#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.kubernetes_service.nginx_service will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx_service"  {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)
      + spec                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-ingress-controller"
          + namespace        = "nginx"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # digitalocean_kubernetes_cluster.personal will be created
  + resource "digitalocean_kubernetes_cluster" "personal" {
      + cluster_subnet = (known after apply)
      + created_at     = (known after apply)
      + endpoint       = (known after apply)
      + id             = (known after apply)
      + ipv4_address   = (known after apply)
      + kube_config    = (sensitive value)
      + name           = "personal"
      + region         = "nyc1"
      + service_subnet = (known after apply)
      + status         = (known after apply)
      + updated_at     = (known after apply)
      + version        = "1.16.6-do.0"

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + name              = "personal"
          + node_count        = 2
          + nodes             = (known after apply)
          + size              = "s-1vcpu-2gb"
        }
    }

  # helm_release.cert_manager will be created
  + resource "helm_release" "cert_manager" {
      + chart            = "cert-manager"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "cert-manager"
      + namespace        = "cert-manager"
      + recreate_pods    = false
      + repository       = "jetstack"
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 300
      + verify           = false
      + version          = "v0.8.1"
      + wait             = true
    }

  # helm_release.external_dns will be created
  + resource "helm_release" "external_dns" {
      + chart            = "external-dns"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "external-dns"
      + namespace        = "external-dns"
      + recreate_pods    = false
      + repository       = "stable"
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 300
      + verify           = false
      + version          = "1.7.9"
      + wait             = true

      + set {
          + name  = "provider"
          + value = "digitalocean"
        }
      + set {
          + name  = "rbac.create"
          + value = "true"
        }

      + set_sensitive {
          + name  = "digitalocean.apiToken"
          + value = (sensitive value)
        }
    }

  # helm_release.k8s_dashboard will be created
  + resource "helm_release" "k8s_dashboard" {
      + chart            = "kubernetes-dashboard"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "kubernetes-dashboard"
      + namespace        = "kube-system"
      + recreate_pods    = false
      + repository       = "stable"
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 300
      + verify           = false
      + version          = "1.7.1"
      + wait             = true
    }

  # helm_release.nginx_ingress will be created
  + resource "helm_release" "nginx_ingress" {
      + chart            = "nginx-ingress"
      + disable_webhooks = false
      + force_update     = false
      + id               = (known after apply)
      + metadata         = (known after apply)
      + name             = "nginx-ingress"
      + namespace        = "nginx"
      + recreate_pods    = false
      + repository       = "stable"
      + reuse            = false
      + reuse_values     = false
      + status           = "DEPLOYED"
      + timeout          = 300
      + verify           = false
      + version          = "1.7.0"
      + wait             = true

      + set {
          + name  = "controller.image.tag"
          + value = "0.23.0"
        }
      + set {
          + name  = "controller.publishService.enabled"
          + value = "true"
        }
    }

  # kubernetes_cluster_role_binding.system_tiller will be created
  + resource "kubernetes_cluster_role_binding" "system_tiller" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "tiller"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "tiller"
          + namespace = "kube-system"
        }
    }

  # kubernetes_namespace.cert_manager will be created
  + resource "kubernetes_namespace" "cert_manager" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "certmanager.k8s.io/disable-validation" = "true"
            }
          + name             = "cert-manager"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.external_dns will be created
  + resource "kubernetes_namespace" "external_dns" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "external-dns"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_namespace.nginx will be created
  + resource "kubernetes_namespace" "nginx" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_service_account.system_tiller will be created
  + resource "kubernetes_service_account" "system_tiller" {
      + default_secret_name = (known after apply)
      + id                  = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "tiller"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
